Revit 2027 API
BuiltInFailures.DPartFailures.DivisionContainsNoReferences Property
 The division contains no dividing references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DivisionContainsNoReferences { get; }
Public Shared ReadOnly Property DivisionContainsNoReferences As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DivisionContainsNoReferences {
	FailureDefinitionId^ get ();
}
static member DivisionContainsNoReferences : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace